

import React from 'react';

import {
  SafeAreaView,
  ScrollView,
  StatusBar,
  StyleSheet,
  Text,
  TextInput,
  useColorScheme,
  View,
  Pressable,Image,
  KeyboardAvoidingView,
  TouchableWithoutFeedback,Keyboard
} from 'react-native';

import {

  DebugInstructions,
  Header,
  LearnMoreLinks,
  ReloadInstructions,
} from 'react-native/Libraries/NewHomeScreen';
import LinearGradient from 'react-native-linear-gradient';
import AntDesignIcons from 'react-native-vector-icons/AntDesign'
import Entypo  from 'react-native-vector-icons/Entypo'
import MaterialCommunityIcons from 'react-native-vector-icons/MaterialCommunityIcons'






function Dos() {


  return (
    <View>
      <View className ="flex items-center justify-center mb-10 mt-5"> 
      <View className='bg-green-700 rounded-md  flex items-center justify-center text-center'>
        <Text className =" text-3xl  p-2 text-white font-urdu" >زیر تربیت افسران کے لیے لازمی کام</Text>
        </View>
      </View>
    <ScrollView className ='mb-10'>
      <View className=" px-3 overflow-scroll mb-20  ">
        <Text className ="text-xl text-black font-urdu p-1 ">
        1.	اپنے زیب تن لباس اور موقع کی مناسبت سے سینئر افسران اور سینئر 
        کورس کے افسران کو پراپر سیلیوٹ کریں گے۔
        {'\n'}
2.	تمام پروگرامز میں وقت کی پابندی کرنا ہوگی۔
{'\n'}
3.	ہمیشہ کالج ڈسپلن کی پابندی کریں گے۔
{'\n'}
4.	میسں میں جاتے وقت نمونہ کے مطابق لباس پہنیں گے۔{'\n'}
5.	کھانے کے بعد کرسی کو دوبارہ اپنی جگہ پر رکھیں گے۔{'\n'}
6.	میسں ، جم ، سپورٹس کمپلیکس ، سوئمنگ پول میں اپنے مقرر کردہ وقت پر جائیں {'\n'}گے۔
7.	سوئمنگ صرف لائف گارڈ کی زیرنگرانی کریں گے۔{'\n'}
8.	جب بھی اپنے رہائشی کمرے سے نکلیں تو لائٹس اور سیکھے بند کریں گے۔{'\n'}
9.	جب بھی اپنے رہائشی کمرے سے نکلیں تو مارچ کر کے اور قطار بنا کر چلیں گے۔{'\n'}
10.	اپنے رہائشی کمروں اور ہاسٹل کو صاف ستھرار کھیں گے۔{'\n'}
11.	کوڑا کرکٹ اور سگریٹ کچرادان میں پھینکیں گے اور کہیں کا غذ وغیرہ نظر آئے {'\n'}تو اسکو اٹھا کر کچرادان میں ڈال دیں گے۔
12.	اپنے کمرے کے علاوہ کہیں کا لج امر یا میں سگریٹ نوشی نہ کریں گے۔{'\n'}
13.	تمام عمارات میں داخل ہونے سے پہلے ڈور میٹ پر پاؤں جھاڑیں گے ۔{'\n'}
14.	کان کی عمارت کو اپنا گھر سمجھتے ہوئے اس کی حفاظت اور صفائی ستھرائی کو {'\n'}یقینی بنائیں گے
15.	دوران تبدیلی ڈیوٹی با قاعدہ چارٹ کا لین دین کریں گے۔{'\n'}
16.	۔ اپنی ڈیوٹی نہایت ایمانداری ، دل جمعی اور الرٹ ہو کر انجام دیں گے۔{'\n'}
17.	سپورٹس کمپلیکس میں رکھے گئے سامان کی حفاظت کریں گے اور توڑ پھوڑ سے بچائیں۔{'\n'}
18.	کیفے ٹیریا اور میس کے عملہ سے ہمیشہ اخلاق سے پیش آئیں۔{'\n'}
19.	لائبریری کتب کی حفاظت کو یقینی بنائیں گے۔{'\n'}
20.	کوئی بھی درخواست ہمیشہ تھرو پراپر چینل بھجوائیں کے۔{'\n'}
21.	ہمیشہ Chain of Command  کا خیال رئیں گے{'\n'}
22.	غیر ضروری چھٹیاں کرنے اور غیر حاضر ہونے سے اجتناب کریں گے{'\n'}
23.	کالج سے روانگی SOP کے مطابق کریں گے۔{'\n'}
24.	تمام نصابی اور غیر نصابی سرگرمیوں میں بڑھ چڑھ کر حصہ لیں گے۔{'\n'}
25.	پی ٹی، پریڈ اور لاء کلاس میں نیک نیتی سے بھر پور دلچسپی دکھائیں گے۔{'\n'}
26.	دوران کلاس ایک وقت میں صرف ایک ہی ٹرینی واش روم یا پانی پینے جائے گا۔{'\n'}
27.	روزانہ اپنے ہاسٹل نوٹس بورڈ ، اور اکیڈمک بلاک نوٹس بورڈ کا مطالعہ کرتے {'\n'}رہیں۔
28.	دوران ڈیوٹی اپنے اردگر دنظر رکھیں گے۔{'\n'}
29.	غیر متعلقہ افراد پر کڑی نظر رکھیں گے۔{'\n'}
30.	نماز کی پابندی کریں گے۔{'\n'}
31.	بلا وجہ وفاتر کی جانب نہیں جائیں گے۔{'\n'}
32.	لائٹ آؤٹ ٹائم کی پابندی کی یقینی بنائیں گے۔{'\n'}
33.	ہمیشہ بہترین ٹرن آؤٹ کو یقینی بنائیں گے۔{'\n'}
34.	ہر روز جوتے پالش کریں گے۔{'\n'}
35.	روزانہ شیو داڑھی اور خط بنائیں گے۔{'\n'}
36.	بالوں کی ہدایت کے مطابق سولجرکٹنگ کروائیں گے۔{'\n'}
37.	نیم پلیٹ( Name Plate) نمونہ کے مطابق استعمال کریں گے اور کالج کی حدود کے اندر اپنے ہاسٹل کے علاوہ ہر وقت سکیورٹی کارڈ پہن کر رکھیں گے۔
{'\n'}

38.	  یونیفارم نمونہ کے مطابق پہنیں گے۔{'\n'}
  
          
        </Text>
        <Text className='font-urdu text-blue-800 text-2xl '>
        نوٹ: ہر انسٹرکٹر ہدایات کی خلاف ورزی کرنے والے ٹرینی کو چیک کرنے اور سزا دینے کا مجاز ہے۔
</Text>
        <Text className='text-center py-7'>---------END----------</Text>
        </View>
        
        </ScrollView>
    </View>
  );
}



export default Dos;



